I can confirm in my local that terraform plan is successful.
```
% terraform plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # google_compute_instance.cromwell_server will be created
  + resource "google_compute_instance" "cromwell_server" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-standard-4"
      + metadata                  = (known after apply)
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "cromwell-server"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + tags                      = [
          + "cromwell-iap",
        ]
      + tags_fingerprint          = (known after apply)
      + zone                      = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-10-buster-v20220406"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "cromwell-vpc"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + min_node_cpus       = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

  # google_project_iam_member.service_account_roles["roles/browser"] will be created
  + resource "google_project_iam_member" "service_account_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/browser"
    }

  # google_project_iam_member.service_account_roles["roles/cloudsql.client"] will be created
  + resource "google_project_iam_member" "service_account_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.service_account_roles["roles/lifesciences.workflowsRunner"] will be created
  + resource "google_project_iam_member" "service_account_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/lifesciences.workflowsRunner"
    }

  # google_project_iam_member.service_account_roles["roles/serviceusage.serviceUsageConsumer"] will be created
  + resource "google_project_iam_member" "service_account_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/serviceusage.serviceUsageConsumer"
    }

  # google_project_iam_member.service_account_roles["roles/storage.objectAdmin"] will be created
  + resource "google_project_iam_member" "service_account_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/storage.objectAdmin"
    }

  # google_project_organization_policy.restrict_vpc_peering_policy[0] will be created
  + resource "google_project_organization_policy" "restrict_vpc_peering_policy" {
      + constraint  = "compute.restrictVpcPeering"
      + etag        = (known after apply)
      + id          = (known after apply)
      + project     = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all    = false
              + values = [
                  + "under:organizations/433637338589",
                ]
            }
        }
    }

  # google_project_organization_policy.shielded_vm_policy[0] will be created
  + resource "google_project_organization_policy" "shielded_vm_policy" {
      + constraint  = "compute.requireShieldedVm"
      + etag        = (known after apply)
      + id          = (known after apply)
      + project     = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = false
        }
    }

  # google_project_organization_policy.trustedimage_project_policy[0] will be created
  + resource "google_project_organization_policy" "trustedimage_project_policy" {
      + constraint  = "compute.trustedImageProjects"
      + etag        = (known after apply)
      + id          = (known after apply)
      + project     = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all = true
            }
        }
    }

  # google_project_service.enabled_services["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "enabled_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.enabled_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "enabled_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "compute.googleapis.com"
    }

  # google_project_service.enabled_services["iam.googleapis.com"] will be created
  + resource "google_project_service" "enabled_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "iam.googleapis.com"
    }

  # google_project_service.enabled_services["lifesciences.googleapis.com"] will be created
  + resource "google_project_service" "enabled_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "lifesciences.googleapis.com"
    }

  # google_project_service.enabled_services["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "enabled_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "servicenetworking.googleapis.com"
    }

  # google_project_service.enabled_services["serviceusage.googleapis.com"] will be created
  + resource "google_project_service" "enabled_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "serviceusage.googleapis.com"
    }

  # google_project_service.enabled_services["sql-component.googleapis.com"] will be created
  + resource "google_project_service" "enabled_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "sql-component.googleapis.com"
    }

  # google_project_service.enabled_services["sqladmin.googleapis.com"] will be created
  + resource "google_project_service" "enabled_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "sqladmin.googleapis.com"
    }

  # google_service_account_iam_member.cromwell_account_iam will be created
  + resource "google_service_account_iam_member" "cromwell_account_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_storage_bucket.cromwell_workflow_bucket will be created
  + resource "google_storage_bucket" "cromwell_workflow_bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + cors {
          + max_age_seconds = 3600
          + method          = [
              + "GET",
              + "HEAD",
              + "PUT",
              + "POST",
              + "DELETE",
            ]
          + origin          = [
              + "http://user-scripts",
            ]
          + response_header = [
              + "*",
            ]
        }
    }

  # google_storage_bucket_object.bootstrap will be created
  + resource "google_storage_bucket_object" "bootstrap" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "provisioning/bootstrap.sh"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # google_storage_bucket_object.config will be created
  + resource "google_storage_bucket_object" "config" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "provisioning/cromwell.conf"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # google_storage_bucket_object.service will be created
  + resource "google_storage_bucket_object" "service" {
      + bucket         = (known after apply)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "provisioning/cromwell.service"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "scripts/build/cromwell.service"
      + storage_class  = (known after apply)
    }

  # random_id.default will be created
  + resource "random_id" "default" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_password.cromwell_db_pass will be created
  + resource "random_password" "cromwell_db_pass" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # time_sleep.wait_120_seconds[0] will be created
  + resource "time_sleep" "wait_120_seconds" {
      + create_duration = "120s"
      + id              = (known after apply)
    }

  # module.cloud-nat.google_compute_router.router[0] will be created
  + resource "google_compute_router" "router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cromwell-vpc-nat-router"
      + network            = "cromwell-vpc"
      + project            = (known after apply)
      + region             = "us-central1"
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode = "DEFAULT"
          + asn            = 64514
        }
    }

  # module.cloud-nat.google_compute_router_nat.main will be created
  + resource "google_compute_router_nat" "main" {
      + enable_endpoint_independent_mapping = true
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + min_ports_per_vm                    = 64
      + name                                = "cromwell-vpc-nat"
      + nat_ip_allocate_option              = "AUTO_ONLY"
      + project                             = (known after apply)
      + region                              = "us-central1"
      + router                              = "cromwell-vpc-nat-router"
      + source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_transitory_idle_timeout_sec     = 30
      + udp_idle_timeout_sec                = 30
    }

  # module.cloud-nat.random_string.name_suffix will be created
  + resource "random_string" "name_suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.cromwell_mysql_db.google_sql_database.additional_databases["cromwell"] will be created
  + resource "google_sql_database" "additional_databases" {
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = "cromwelldb"
      + name      = "cromwell"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # module.cromwell_mysql_db.google_sql_database.default[0] will be created
  + resource "google_sql_database" "default" {
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = "cromwelldb"
      + name      = "default"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # module.cromwell_mysql_db.google_sql_database_instance.default will be created
  + resource "google_sql_database_instance" "default" {
      + connection_name               = (known after apply)
      + database_version              = "MYSQL_8_0"
      + deletion_protection           = false
      + encryption_key_name           = (known after apply)
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "cromwelldb"
      + private_ip_address            = (known after apply)
      + project                       = (known after apply)
      + public_ip_address             = (known after apply)
      + region                        = "us-central1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy           = "ALWAYS"
          + authorized_gae_applications = (known after apply)
          + availability_type           = "REGIONAL"
          + crash_safe_replication      = (known after apply)
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = 10
          + disk_type                   = "PD_SSD"
          + pricing_plan                = "PER_USE"
          + replication_type            = (known after apply)
          + tier                        = "db-n1-standard-2"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = true
              + enabled                        = true
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = (known after apply)
                  + retention_unit   = (known after apply)
                }
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = (known after apply)
              + require_ssl     = false
            }

          + location_preference {
              + zone = "us-central1-a"
            }

          + maintenance_window {
              + day          = 1
              + hour         = 23
              + update_track = "canary"
            }
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.cromwell_mysql_db.google_sql_user.additional_users["cromwell"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = "%"
      + id       = (known after apply)
      + instance = "cromwelldb"
      + name     = "cromwell"
      + password = (sensitive value)
      + project  = (known after apply)
    }

  # module.cromwell_mysql_db.google_sql_user.default[0] will be created
  + resource "google_sql_user" "default" {
      + host     = "%"
      + id       = (known after apply)
      + instance = "cromwelldb"
      + name     = "default"
      + password = (sensitive value)
      + project  = (known after apply)
    }

  # module.cromwell_mysql_db.null_resource.module_depends_on will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "1"
        }
    }

  # module.cromwell_mysql_db.random_id.additional_passwords["cromwell"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "name" = "cromwelldb"
        }
    }

  # module.cromwell_mysql_db.random_id.user-password will be created
  + resource "random_id" "user-password" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "name" = "cromwelldb"
        }
    }

  # module.cromwell_service_account.google_service_account.service_accounts["cromwell-sa"] will be created
  + resource "google_service_account" "service_accounts" {
      + account_id   = "cromwell-sa"
      + description  = "Service Account used to run Cromwell server and worker VMs"
      + disabled     = false
      + display_name = "Cromwell Service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.private-service-access.data.google_compute_network.main will be read during apply
  # (config refers to values not yet known)
 <= data "google_compute_network" "main"  {
      + description            = (known after apply)
      + gateway_ipv4           = (known after apply)
      + id                     = (known after apply)
      + name                   = "cromwell-vpc"
      + project                = (known after apply)
      + self_link              = (known after apply)
      + subnetworks_self_links = (known after apply)
    }

  # module.private-service-access.google_compute_global_address.google-managed-services-range will be created
  + resource "google_compute_global_address" "google-managed-services-range" {
      + address            = "10.128.50.0"
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "google-managed-services-cromwell-vpc"
      + network            = (known after apply)
      + prefix_length      = 24
      + project            = (known after apply)
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
    }

  # module.private-service-access.google_service_networking_connection.private_service_access will be created
  + resource "google_service_networking_connection" "private_service_access" {
      + id                      = (known after apply)
      + network                 = (known after apply)
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "google-managed-services-cromwell-vpc",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

  # module.private-service-access.null_resource.dependency_setter will be created
  + resource "null_resource" "dependency_setter" {
      + id = (known after apply)
    }

  # module.project_radlab_gen_cromwell[0].module.budget.data.google_project.project[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.project_radlab_gen_cromwell[0].module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "<REDACTED>"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "vpc-network" = "cromwell-vpc"
        }
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = "<REDACTED>"
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.project_radlab_gen_cromwell[0].module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DISABLE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.project_radlab_gen_cromwell[0].module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + disabled     = false
      + display_name = (known after apply)
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.project_radlab_gen_cromwell[0].module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.vpc_cromwell[0].module.firewall_rules.google_compute_firewall.rules["fw-cromwell-allow-iap"] will be created
  + resource "google_compute_firewall" "rules" {
      + creation_timestamp = (known after apply)
      + description        = "Firewall rule to allow traffic on SSH and Cromwell port to IAP range"
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "fw-cromwell-allow-iap"
      + network            = "cromwell-vpc"
      + priority           = 65534
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "35.235.240.0/20",
        ]
      + target_tags        = [
          + "cromwell-iap",
        ]

      + allow {
          + ports    = [
              + "22",
              + "8000",
            ]
          + protocol = "tcp"
        }
    }

  # module.vpc_cromwell[0].module.firewall_rules.google_compute_firewall.rules["fw-cromwell-allow-internal"] will be created
  + resource "google_compute_firewall" "rules" {
      + creation_timestamp = (known after apply)
      + description        = "Firewall rule to allow traffic on all ports inside *vpc-cromwell* VPC network."
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "fw-cromwell-allow-internal"
      + network            = "cromwell-vpc"
      + priority           = 65534
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.0.0.0/8",
        ]

      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "tcp"
        }
    }

  # module.vpc_cromwell[0].module.subnets.google_compute_subnetwork.subnetwork["us-central1/cromwell-vpc"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + description                = "Subnetwork inside Cromwell VPC network, created via Terraform"
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.142.190.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "cromwell-vpc"
      + network                    = "cromwell-vpc"
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + secondary_ip_range         = []
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.vpc_cromwell[0].module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + description                     = "VPC Network created via Terraform"
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "cromwell-vpc"
      + project                         = (known after apply)
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

Plan: 48 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + GCS_Bucket_URL                 = (known after apply)
  + cromell_server_internal_IP     = (known after apply)
  + cromwell_server_instance_id    = "cromwell-server"
  + cromwell_server_zone           = "us-central1-a"
  + cromwell_service_account_email = (known after apply)
  + gcloud_iap_command             = (known after apply)
  + project_id                     = (known after apply)

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```